import img from "../../../../Assets/Images/WhiteFly/how-it-work-image.png";
import "./HowItWork.scss";

export function HowItWork(): JSX.Element {
    return (
        <div className="HowItWork">
            <div className="imageContainer">
                <img src={img} />
            </div>
            <div className="textContainer">
                <h1>אז איך זה עובד?</h1>
                <ol>
                    <li>יצירה - משתמשים יכולים ליצור בקלות אתר זיכרון על ידי הרשמה לפלטפורמת הזיכרון הנצחי.    הם יכולים לבחור מתוך מגוון תבניות ואפשרויות התאמה אישית כדי להתאים אישית את האתר בהתאם להעדפותיהם.</li>
                    <li>הוספת תוכן - לאחר יצירת האתר, המשתמשים יכולים להתחיל להוסיף תוכן כגון תמונות, סרטונים ומחווה כתובה.    הם יכולים גם להזמין חברים ובני משפחה לתרום את הזיכרונות וההודעות שלהם.</li>
                    <li>שיתוף וגישה - לאחר השלמת האתר, המשתמשים יכולים לשתף את הקישור עם הרשת שלהם, לאפשר לחברים,בני משפחה ומכרים לבקר ולקיים אינטראקציה עם המחווה. ניתן לשלוט בגישה לאתר באמצעות הגנת סיסמה או גישה להזמנה בלבד.</li>
                    <li>תחזוקה ועדכונים - זיכרון נצח מספק כלים למשתמשים לעדכן ולתחזק בקלות את אתר הזיכרון לאורך זמן.בין אם מדובר בהוספת תמונות חדשות, שיתוף ימי נישואין של אבני דרך או עריכת תוכן, למשתמשים יש שליטה מלאה על המחווה.</li>
                </ol>
            </div>
        </div>
    );
}
