import "./Advantages.scss";

export function Advantages(): JSX.Element {
    return (
        <div className="Advantages">
            <div className="advantagesContainer">
                <h1>מה היתרונות</h1>
                <ol>
                    <li> שימור זיכרונות - הזיכרון הנצחי מבטיח שהזיכרונות והסיפורים של יקיריהם נשמרים ושותפים בצורה משמעותית, ומאפשרים לדורות הבאים ללמוד ולהעריך את מורשתם.</li>
                    <li>ריפוי וסגירה - יצירת אתר זיכרון יכולה להיות תהליך קתרזי עבור אנשים אבלים, לספק להם מוצא בונה להביע את רגשותיהם ולחגוג את חיי יקירם.</li>
                    <li>נגישות - על ידי אירוח אתר הזיכרון באינטרנט, זיכרון נצח מבטיח שחברים ובני משפחה מרחבי העולם יוכלו לגשת ולתרום למחווה, ללא קשר למיקומם.</li>
                    <li>מחווה מתמשכת - שלא כמו אנדרטאות מסורתיות שעשויות לדעוך עם הזמן, אתרי זיכרון שנוצרו על ידי Eternal Remembrance מספקים מחווה מתמשכת וירוק עד שניתן לבקר ולהוקיר עד אין קץ. בסך הכל, זיכרון נצח מציע שירות חמלה ומקצועי המעצים משפחות וחברים ליצור מחווה יפה ומתמשכת ליקיריהם שהלכו לעולמם.  באמצעות אתרי זיכרון מותאמים אישית, הם עוזרים לשמור על זיכרונות בחיים ומבטיחים שהמורשת תכובד ונחגג לדורות הבאים.</li>
                </ol>
            </div>
        </div>
    );
}
